
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  29 Mar 2020, 21:42:41

. 
. quietly{

. 
. esttab, b(3) se(3) wide nogaps nodepvars compress noparentheses

--------------------------------------------------------
                 (1)                    (2)             
                est1                   est2             
--------------------------------------------------------
main                                                    
bc_neg_c~n     0.013***     0.000     0.013***     0.000
arf            0.020***     0.004     0.014***     0.001
c.bc_neg~f     0.016***     0.001    -0.001        0.001
bc_pos_c~n    -0.057***     0.001    -0.066***     0.000
w              0.000***     0.000    -0.001***     0.000
0.q            0.000            .     0.000            .
1.q           -0.010***     0.002    -0.035***     0.001
2.q            0.004        0.003    -0.044***     0.001
3.q            0.037***     0.003    -0.025***     0.001
0.items_w      0.000            .     0.000            .
1.items_w     -0.000        0.001     0.002***     0.000
2.items_w      0.045***     0.001     0.014***     0.000
0.sales_w      0.000            .     0.000            .
1.sales_w     -0.015***     0.001    -0.025***     0.000
internat~t     0.009***     0.001     0.004***     0.000
arm_maxw       0.147***     0.001     0.030***     0.000
_cons          0.029***     0.001     0.127***     0.000
--------------------------------------------------------
lns1_1_1                                                
_cons         -3.819***     0.027    -4.724***     0.025
--------------------------------------------------------
lnsig_e                                                 
_cons         -3.581***     0.005    -4.595***     0.005
--------------------------------------------------------
N              24551                  24551             
--------------------------------------------------------
Standard errors in second column
* p<0.05, ** p<0.01, *** p<0.001

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:  29 Mar 2020, 21:43:09
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. save "/Users/MacbookJos/.ipython/stata/data_output.dta", replace 
file /Users/MacbookJos/.ipython/stata/data_output.dta saved

. 
. 
end of do-file
