
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:   1 Apr 2020, 14:17:50

. 
. quietly{

. mixed ame c.bc_neg_count_min##c.arf bc_pos_count_min c.w i.q* i.items_w* i.sales_w* international_shipment arm_maxw|| vendor:

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood =  76580.244  
Iteration 1:   log likelihood =  76580.244  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =     24,551
Group variable: vendor                          Number of groups  =      1,040

                                                Obs per group:
                                                              min =          1
                                                              avg =       23.6
                                                              max =         51

                                                Wald chi2(13)     =  502327.16
Log likelihood =  76580.244                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------------------
                     ame |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
        bc_neg_count_min |   .0131953   .0001743    75.69   0.000     .0128536    .0135369
                     arf |   .0136623   .0014218     9.61   0.000     .0108756    .0164489
                         |
c.bc_neg_count_min#c.arf |    -.00091   .0005397    -1.69   0.092    -.0019678    .0001479
                         |
        bc_pos_count_min |  -.0663495    .000206  -322.09   0.000    -.0667533   -.0659458
                       w |  -.0005733   9.53e-06   -60.15   0.000     -.000592   -.0005546
                         |
                       q |
                      2  |   -.035361   .0009223   -38.34   0.000    -.0371687   -.0335532
                      3  |  -.0443229   .0011648   -38.05   0.000     -.046606   -.0420399
                      4  |  -.0249634   .0010159   -24.57   0.000    -.0269546   -.0229722
                         |
                 items_w |
                 medium  |   .0017962   .0002074     8.66   0.000     .0013896    .0022028
                   high  |   .0142946   .0002814    50.79   0.000      .013743    .0148462
                         |
                 sales_w |
                   high  |  -.0249848   .0001998  -125.04   0.000    -.0253764   -.0245931
  international_shipment |   .0036546   .0004055     9.01   0.000     .0028599    .0044494
                arm_maxw |   .0302583   .0004288    70.56   0.000     .0294179    .0310987
                   _cons |     .12716   .0004974   255.64   0.000     .1261851     .128135
------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
vendor: Identity             |
                  var(_cons) |   .0000789   4.02e-06      .0000714    .0000872
-----------------------------+------------------------------------------------
               var(Residual) |    .000102   9.43e-07      .0001002    .0001039
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 8040.87       Prob >= chibar2 = 0.0000

. esttab, b(3) se(3) wide nogaps nodepvars compress noparentheses
(tabulating estimates stored by eststo; specify "." to tabulate the active results)

--------------------------------------------------------
                 (1)                    (2)             
                est1                   est2             
--------------------------------------------------------
main                                                    
bc_neg_c~n     0.013***     0.000     0.013***     0.000
arf            0.020***     0.004     0.014***     0.001
c.bc_neg~f     0.016***     0.001    -0.001        0.001
bc_pos_c~n    -0.057***     0.001    -0.066***     0.000
w              0.000***     0.000    -0.001***     0.000
0.q            0.000            .     0.000            .
1.q           -0.010***     0.002    -0.035***     0.001
2.q            0.004        0.003    -0.044***     0.001
3.q            0.037***     0.003    -0.025***     0.001
0.items_w      0.000            .     0.000            .
1.items_w     -0.000        0.001     0.002***     0.000
2.items_w      0.045***     0.001     0.014***     0.000
0.sales_w      0.000            .     0.000            .
1.sales_w     -0.015***     0.001    -0.025***     0.000
internat~t     0.009***     0.001     0.004***     0.000
arm_maxw       0.147***     0.001     0.030***     0.000
_cons          0.029***     0.001     0.127***     0.000
--------------------------------------------------------
lns1_1_1                                                
_cons         -3.819***     0.027    -4.724***     0.025
--------------------------------------------------------
lnsig_e                                                 
_cons         -3.581***     0.005    -4.595***     0.005
--------------------------------------------------------
N              24551                  24551             
--------------------------------------------------------
Standard errors in second column
* p<0.05, ** p<0.01, *** p<0.001

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:   1 Apr 2020, 14:18:35
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. save "/Users/MacbookJos/.ipython/stata/data_output.dta", replace 
file /Users/MacbookJos/.ipython/stata/data_output.dta saved

. 
. 
end of do-file
