
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  18 Mar 2020, 12:56:44

. 
. gen ln_neg_count_min = ln(neg_count_min)

. gen ln_pos_count_min = ln(pos_count_min)

. 
. // group items in terciles
. gen items = .
(24,551 missing values generated)

. replace items = 0 if item_count <=13
(8,458 real changes made)

. replace items = 1 if item_count > 13 & item_count <= 32
(8,075 real changes made)

. replace items = 2 if item_count > 32
(8,018 real changes made)

. 
. // group categories in terciles 
. gen categories = .
(24,551 missing values generated)

. replace categories = 0 if category_count <=2
(8,360 real changes made)

. replace categories = 1 if category_count > 2 & category_count <= 4
(9,141 real changes made)

. replace categories = 2 if category_count > 4
(7,050 real changes made)

. 
. recode m_maxw (12 = 11)
(m_maxw: 28 changes made)

. 
. melogit has_price_drop c.ln_neg_count_min##c.arf ln_pos_count_min arm_maxw c.w##c.w i.m_maxw i.items i.categories|| vendor: arf

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7876.2735  
Iteration 1:   log likelihood = -7686.0214  
Iteration 2:   log likelihood = -7681.5238  
Iteration 3:   log likelihood =  -7681.253  
Iteration 4:   log likelihood = -7681.2518  
Iteration 5:   log likelihood = -7681.2518  

Refining starting values:

Grid node 0:   log likelihood = -7867.5282

Fitting full model:

Iteration 0:   log likelihood = -7867.5282  (not concave)
Iteration 1:   log likelihood = -7847.2827  (not concave)
Iteration 2:   log likelihood = -7827.1416  (not concave)
Iteration 3:   log likelihood = -7687.5206  
Iteration 4:   log likelihood = -7678.5773  
Iteration 5:   log likelihood = -7678.1318  
Iteration 6:   log likelihood = -7678.1234  
Iteration 7:   log likelihood = -7678.1234  

Mixed-effects logistic regression               Number of obs     =     24,551
Group variable:          vendor                 Number of groups  =      1,040

                                                Obs per group:
                                                              min =          1
                                                              avg =       23.6
                                                              max =         51

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(21)     =     451.40
Log likelihood = -7678.1234                     Prob > chi2       =     0.0000
------------------------------------------------------------------------------------------
          has_price_drop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
        ln_neg_count_min |   -.029569   .0175251    -1.69   0.092    -.0639175    .0047795
                     arf |  -.0974179   .2580641    -0.38   0.706    -.6032143    .4083784
                         |
c.ln_neg_count_min#c.arf |  -.0012606   .0726744    -0.02   0.986    -.1436999    .1411786
                         |
        ln_pos_count_min |  -.0171427   .0256818    -0.67   0.504     -.067478    .0331926
                arm_maxw |  -.0405851   .1415518    -0.29   0.774    -.3180216    .2368514
                       w |   .0189173   .0078449     2.41   0.016     .0035416    .0342931
                         |
                 c.w#c.w |  -.0009099   .0001625    -5.60   0.000    -.0012285   -.0005913
                         |
                  m_maxw |
                      2  |  -.1800742    .057148    -3.15   0.002    -.2920822   -.0680663
                      3  |  -.3677496   .0658047    -5.59   0.000    -.4967245   -.2387748
                      4  |  -.4010233   .1010849    -3.97   0.000     -.599146   -.2029005
                      5  |   -1.12624   .2084702    -5.40   0.000    -1.534834    -.717646
                      6  |  -1.352916   .2792687    -4.84   0.000    -1.900273   -.8055592
                      7  |  -1.377812   .2535687    -5.43   0.000    -1.874798   -.8808268
                      8  |  -.9101544   .2841668    -3.20   0.001    -1.467111   -.3531977
                      9  |  -1.849568   .3450829    -5.36   0.000    -2.525918   -1.173218
                     10  |  -1.543899   .3479112    -4.44   0.000    -2.225792   -.8620052
                     11  |  -3.339569   .5832979    -5.73   0.000    -4.482812   -2.196326
                         |
                   items |
                      1  |  -.2467482   .0611338    -4.04   0.000    -.3665683   -.1269281
                      2  |  -.5108423   .0810986    -6.30   0.000    -.6697925    -.351892
                         |
              categories |
                      1  |  -.1350096   .0574662    -2.35   0.019    -.2476413    -.022378
                      2  |  -.1424167   .0732019    -1.95   0.052    -.2858897    .0010563
                         |
                   _cons |  -1.406441   .1073091   -13.11   0.000    -1.616762   -1.196119
-------------------------+----------------------------------------------------------------
vendor                   |
                 var(arf)|   .2573353   .2102244                      .0518954    1.276056
               var(_cons)|   .0270175   .0205893                      .0060669    .1203159
------------------------------------------------------------------------------------------
LR test vs. logistic model: chi2(2) = 6.26                Prob > chi2 = 0.0438

Note: LR test is conservative and provided only for reference.

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:  18 Mar 2020, 12:56:54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
