
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  13 Apr 2020, 14:55:35

. 
. //#standardize time variables
. qui: sum w 

. qui: gen w_ = (w - r(min)) / (r(max) - r(min))    

. qui: sum me 

. qui: gen me_ = (me - r(min)) / (r(max) - r(min))

. 
. 
. ppmlhdfe c_neg_count_w_shift 
Iteration 1:   deviance = 3.7325e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -1.01  PS  
Iteration 2:   deviance = 3.3168e+05  eps = 1.25e-01  iters = 1    tol = 1.0e-04  min(eta) =  -1.50   S  
Iteration 3:   deviance = 3.2888e+05  eps = 8.49e-03  iters = 1    tol = 1.0e-04  min(eta) =  -1.67   S  
Iteration 4:   deviance = 3.2886e+05  eps = 6.28e-05  iters = 1    tol = 1.0e-04  min(eta) =  -1.69   S  
Iteration 5:   deviance = 3.2886e+05  eps = 4.23e-09  iters = 1    tol = 1.0e-05  min(eta) =  -1.69   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 5 iterations and 5 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     22,777
                                                  Residual df     =     22,776
                                                  Wald chi2(0)    =          .
Deviance             =  328861.5584               Prob > chi2     =          .
Log pseudolikelihood = -177408.0548               Pseudo R2       =     0.0000
------------------------------------------------------------------------------
             |               Robust
c_neg_coun~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   1.191964   .0358692    33.23   0.000     1.121661    1.262266
------------------------------------------------------------------------------

. 
. ppmlhdfe c_neg_count_w_shift,                                   ///
>     cluster(vendor) keepsingletons
warning: keeping singleton groups will keep fixed effects that cause separation
Iteration 1:   deviance = 3.7325e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -1.01  PS  
Iteration 2:   deviance = 3.3168e+05  eps = 1.25e-01  iters = 1    tol = 1.0e-04  min(eta) =  -1.50   S  
Iteration 3:   deviance = 3.2888e+05  eps = 8.49e-03  iters = 1    tol = 1.0e-04  min(eta) =  -1.67   S  
Iteration 4:   deviance = 3.2886e+05  eps = 6.28e-05  iters = 1    tol = 1.0e-04  min(eta) =  -1.69   S  
Iteration 5:   deviance = 3.2886e+05  eps = 4.23e-09  iters = 1    tol = 1.0e-05  min(eta) =  -1.69   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 5 iterations and 5 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     22,777
                                                  Residual df     =        901
Statistics robust to heteroskedasticity           Wald chi2(0)    =          .
Deviance             =  328861.5584               Prob > chi2     =          .
Log pseudolikelihood = -177408.0548               Pseudo R2       =     0.0000

Number of clusters (vendor) =        902
                               (Std. Err. adjusted for 902 clusters in vendor)
------------------------------------------------------------------------------
             |               Robust
c_neg_coun~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   1.191964   .1091775    10.92   0.000     .9779795    1.405948
------------------------------------------------------------------------------

. 
. ppmlhdfe c_neg_count_w_shift,                                   ///
>     cluster(vendor w) keepsingletons
warning: keeping singleton groups will keep fixed effects that cause separation
Iteration 1:   deviance = 3.7325e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -1.01  PS  
Iteration 2:   deviance = 3.3168e+05  eps = 1.25e-01  iters = 1    tol = 1.0e-04  min(eta) =  -1.50   S  
Iteration 3:   deviance = 3.2888e+05  eps = 8.49e-03  iters = 1    tol = 1.0e-04  min(eta) =  -1.67   S  
Iteration 4:   deviance = 3.2886e+05  eps = 6.28e-05  iters = 1    tol = 1.0e-04  min(eta) =  -1.69   S  
Iteration 5:   deviance = 3.2886e+05  eps = 4.23e-09  iters = 1    tol = 1.0e-05  min(eta) =  -1.69   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 5 iterations and 5 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     22,777
                                                  Residual df     =         49
Statistics robust to heteroskedasticity           Wald chi2(0)    =          .
Deviance             =  328861.5584               Prob > chi2     =          .
Log pseudolikelihood = -177408.0548               Pseudo R2       =     0.0000

Number of clusters (vendor) =        902
Number of clusters (w)      =         50
                              (Std. Err. adjusted for 50 clusters in vendor w)
------------------------------------------------------------------------------
             |               Robust
c_neg_coun~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   1.191964   .1195919     9.97   0.000     .9575677    1.426359
------------------------------------------------------------------------------

.     
. ppmlhdfe c_neg_count_w_shift                                    ///
>          bc_pos_count_w bc_item_count_w                         ///
>          bc_int_shipment_count_w                                ///
>          has_price_drop c.me_##c.me_ c.w_##c.w_,                ///
>     cluster(vendor w)
Iteration 1:   deviance = 2.6900e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -6.19  P   
Iteration 2:   deviance = 2.2553e+05  eps = 1.93e-01  iters = 1    tol = 1.0e-04  min(eta) =  -6.96      
Iteration 3:   deviance = 2.2227e+05  eps = 1.47e-02  iters = 1    tol = 1.0e-04  min(eta) =  -7.39      
Iteration 4:   deviance = 2.2223e+05  eps = 1.79e-04  iters = 1    tol = 1.0e-04  min(eta) =  -7.48      
Iteration 5:   deviance = 2.2223e+05  eps = 7.18e-08  iters = 1    tol = 1.0e-04  min(eta) =  -7.48      
Iteration 6:   deviance = 2.2223e+05  eps = 3.40e-14  iters = 1    tol = 1.0e-05  min(eta) =  -7.48   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 6 iterations and 6 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     22,777
                                                  Residual df     =         49
Statistics robust to heteroskedasticity           Wald chi2(8)    =     518.86
Deviance             =  222230.9571               Prob > chi2     =     0.0000
Log pseudolikelihood = -124092.7541               Pseudo R2       =     0.3005

Number of clusters (vendor) =        902
Number of clusters (w)      =         50
                                         (Std. Err. adjusted for 50 clusters in vendor w)
-----------------------------------------------------------------------------------------
                        |               Robust
    c_neg_count_w_shift |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
         bc_pos_count_w |   .2539148   .1487093     1.71   0.088    -.0375499    .5453796
        bc_item_count_w |   .7173462   .1571795     4.56   0.000     .4092799    1.025412
bc_int_shipment_count_w |   .2325154   .0832302     2.79   0.005     .0693873    .3956435
         has_price_drop |   .0115141   .0902074     0.13   0.898    -.1652891    .1883173
                    me_ |   .2280339   1.304654     0.17   0.861    -2.329041    2.785108
                        |
            c.me_#c.me_ |  -2.593272   1.822379    -1.42   0.155    -6.165069    .9785255
                        |
                     w_ |   4.684185   .9259387     5.06   0.000     2.869378    6.498991
                        |
              c.w_#c.w_ |  -8.001506    1.04891    -7.63   0.000    -10.05733    -5.94568
                        |
                  _cons |   .4689742   .1767202     2.65   0.008     .1226089    .8153394
-----------------------------------------------------------------------------------------

.     
. ppmlhdfe c_neg_count_w_shift arf                                ///
>          bc_pos_count_w bc_item_count_w                         ///
>          bc_int_shipment_count_w                                ///
>          has_price_drop c.me_##c.me_ c.w_##c.w_,                ///
>     cluster(vendor w)
Iteration 1:   deviance = 2.6827e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -6.20  P   
Iteration 2:   deviance = 2.2449e+05  eps = 1.95e-01  iters = 1    tol = 1.0e-04  min(eta) =  -6.96      
Iteration 3:   deviance = 2.2115e+05  eps = 1.51e-02  iters = 1    tol = 1.0e-04  min(eta) =  -7.40      
Iteration 4:   deviance = 2.2111e+05  eps = 1.94e-04  iters = 1    tol = 1.0e-04  min(eta) =  -7.48      
Iteration 5:   deviance = 2.2111e+05  eps = 8.46e-08  iters = 1    tol = 1.0e-04  min(eta) =  -7.49      
Iteration 6:   deviance = 2.2111e+05  eps = 4.69e-14  iters = 1    tol = 1.0e-05  min(eta) =  -7.49   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 6 iterations and 6 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     22,777
                                                  Residual df     =         49
Statistics robust to heteroskedasticity           Wald chi2(9)    =     651.13
Deviance             =  221109.2843               Prob > chi2     =     0.0000
Log pseudolikelihood = -123531.9177               Pseudo R2       =     0.3037

Number of clusters (vendor) =        902
Number of clusters (w)      =         50
                                         (Std. Err. adjusted for 50 clusters in vendor w)
-----------------------------------------------------------------------------------------
                        |               Robust
    c_neg_count_w_shift |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                    arf |   .3111913   .1704338     1.83   0.068    -.0228529    .6452355
         bc_pos_count_w |   .2253674   .1401452     1.61   0.108    -.0493121    .5000469
        bc_item_count_w |    .722019   .1507023     4.79   0.000     .4266481     1.01739
bc_int_shipment_count_w |   .2387272    .078349     3.05   0.002     .0851659    .3922884
         has_price_drop |   .0155718   .0876928     0.18   0.859    -.1563029    .1874465
                    me_ |   .2842121    1.33064     0.21   0.831    -2.323795    2.892219
                        |
            c.me_#c.me_ |  -2.567134   1.816403    -1.41   0.158    -6.127218    .9929497
                        |
                     w_ |    4.71446   .9330563     5.05   0.000     2.885703    6.543216
                        |
              c.w_#c.w_ |   -8.01759   1.056442    -7.59   0.000    -10.08818   -5.947003
                        |
                  _cons |   .4065119   .1778099     2.29   0.022     .0580108    .7550129
-----------------------------------------------------------------------------------------

.     
. margins, dydx(arf)

Average marginal effects                        Number of obs     =     22,777
Model VCE    : Robust

Expression   : Predicted mean of c_neg_count_w_shift, predict()
dy/dx w.r.t. : arf

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         arf |   1.024921   .5499717     1.86   0.062    -.0530034    2.102846
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:  13 Apr 2020, 14:55:39
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
