
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:   9 Apr 2020, 13:01:54

. 
. ppmlhdfe c_neg_count 
Iteration 1:   deviance = 3.8479e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -1.00  PS  
Iteration 2:   deviance = 3.4199e+05  eps = 1.25e-01  iters = 1    tol = 1.0e-04  min(eta) =  -1.50   S  
Iteration 3:   deviance = 3.3912e+05  eps = 8.48e-03  iters = 1    tol = 1.0e-04  min(eta) =  -1.67   S  
Iteration 4:   deviance = 3.3910e+05  eps = 6.27e-05  iters = 1    tol = 1.0e-04  min(eta) =  -1.69   S  
Iteration 5:   deviance = 3.3910e+05  eps = 4.22e-09  iters = 1    tol = 1.0e-05  min(eta) =  -1.69   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 5 iterations and 5 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     23,682
                                                  Residual df     =     23,681
                                                  Wald chi2(0)    =          .
Deviance             =  339097.8777               Prob > chi2     =          .
Log pseudolikelihood = -182904.1518               Pseudo R2       =    -0.0000
------------------------------------------------------------------------------
             |               Robust
 c_neg_count |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |    1.18237   .0350596    33.72   0.000     1.113655    1.251086
------------------------------------------------------------------------------

. 
. ppmlhdfe c_neg_count,                                       ///
>     cluster(vendor w)
Iteration 1:   deviance = 3.8479e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -1.00  PS  
Iteration 2:   deviance = 3.4199e+05  eps = 1.25e-01  iters = 1    tol = 1.0e-04  min(eta) =  -1.50   S  
Iteration 3:   deviance = 3.3912e+05  eps = 8.48e-03  iters = 1    tol = 1.0e-04  min(eta) =  -1.67   S  
Iteration 4:   deviance = 3.3910e+05  eps = 6.27e-05  iters = 1    tol = 1.0e-04  min(eta) =  -1.69   S  
Iteration 5:   deviance = 3.3910e+05  eps = 4.22e-09  iters = 1    tol = 1.0e-05  min(eta) =  -1.69   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 5 iterations and 5 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     23,682
                                                  Residual df     =         50
Statistics robust to heteroskedasticity           Wald chi2(0)    =          .
Deviance             =  339097.8777               Prob > chi2     =          .
Log pseudolikelihood = -182904.1518               Pseudo R2       =    -0.0000

Number of clusters (vendor) =        905
Number of clusters (w)      =         51
                              (Std. Err. adjusted for 51 clusters in vendor w)
------------------------------------------------------------------------------
             |               Robust
 c_neg_count |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |    1.18237   .1182243    10.00   0.000     .9506551    1.414086
------------------------------------------------------------------------------

.     
. ppmlhdfe c_neg_count bc_pos_count                           ///
>       item_count_w c.sales_volume_w international_shipment  ///
>       has_price_drop c.me##c.me c.w##c.w,                   ///
>     cluster(vendor w)
Iteration 1:   deviance = 2.9026e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -6.15  P   
Iteration 2:   deviance = 2.2456e+05  eps = 2.93e-01  iters = 1    tol = 1.0e-04  min(eta) =  -6.98      
Iteration 3:   deviance = 2.1237e+05  eps = 5.74e-02  iters = 1    tol = 1.0e-04  min(eta) =  -7.58      
Iteration 4:   deviance = 2.1084e+05  eps = 7.26e-03  iters = 1    tol = 1.0e-04  min(eta) =  -7.81      
Iteration 5:   deviance = 2.1079e+05  eps = 2.44e-04  iters = 1    tol = 1.0e-04  min(eta) =  -7.84      
Iteration 6:   deviance = 2.1079e+05  eps = 4.01e-07  iters = 1    tol = 1.0e-04  min(eta) =  -7.84      
Iteration 7:   deviance = 2.1079e+05  eps = 1.20e-12  iters = 1    tol = 1.0e-05  min(eta) =  -7.84   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 7 iterations and 7 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     23,682
                                                  Residual df     =         50
Statistics robust to heteroskedasticity           Wald chi2(9)    =    1851.35
Deviance             =  210791.3536               Prob > chi2     =     0.0000
Log pseudolikelihood = -118750.8898               Pseudo R2       =     0.3507

Number of clusters (vendor) =        905
Number of clusters (w)      =         51
                                        (Std. Err. adjusted for 51 clusters in vendor w)
----------------------------------------------------------------------------------------
                       |               Robust
           c_neg_count |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          bc_pos_count |     .93476   .1046244     8.93   0.000        .7297     1.13982
          item_count_w |   .0030501   .0007949     3.84   0.000     .0014922    .0046081
        sales_volume_w |  -.0000498   .0000226    -2.21   0.027     -.000094   -5.58e-06
international_shipment |   .6218125   .1587927     3.92   0.000     .3105846    .9330404
        has_price_drop |  -.2781592   .1156235    -2.41   0.016     -.504777   -.0515414
                    me |   .0297672   .0395901     0.75   0.452    -.0478279    .1073623
                       |
             c.me#c.me |  -.0024081   .0014224    -1.69   0.090    -.0051959    .0003797
                       |
                     w |   .0926936   .0152364     6.08   0.000     .0628308    .1225564
                       |
               c.w#c.w |  -.0031977   .0003318    -9.64   0.000    -.0038479   -.0025474
                       |
                 _cons |  -.0345699   .2055643    -0.17   0.866    -.4374684    .3683287
----------------------------------------------------------------------------------------

.     
. ppmlhdfe c_neg_count bc_pos_count arf                       ///
>       item_count_w c.sales_volume_w international_shipment  ///
>       has_price_drop c.me##c.me c.w##c.w,                   ///
>     cluster(vendor w)
Iteration 1:   deviance = 2.9234e+05  eps = .         iters = 1    tol = 1.0e-04  min(eta) =  -6.18  P   
Iteration 2:   deviance = 2.2376e+05  eps = 3.06e-01  iters = 1    tol = 1.0e-04  min(eta) =  -7.00      
Iteration 3:   deviance = 2.1113e+05  eps = 5.98e-02  iters = 1    tol = 1.0e-04  min(eta) =  -7.59      
Iteration 4:   deviance = 2.0964e+05  eps = 7.14e-03  iters = 1    tol = 1.0e-04  min(eta) =  -7.83      
Iteration 5:   deviance = 2.0959e+05  eps = 2.28e-04  iters = 1    tol = 1.0e-04  min(eta) =  -7.86      
Iteration 6:   deviance = 2.0959e+05  eps = 3.49e-07  iters = 1    tol = 1.0e-04  min(eta) =  -7.86      
Iteration 7:   deviance = 2.0959e+05  eps = 9.10e-13  iters = 1    tol = 1.0e-05  min(eta) =  -7.86   S O
------------------------------------------------------------------------------------------------------------
(legend: p: exact partial-out   s: exact solver   h: step-halving   o: epsilon below tolerance)
Converged in 7 iterations and 7 HDFE sub-iterations (tol = 1.0e-08)

PPML regression                                   No. of obs      =     23,682
                                                  Residual df     =         50
Statistics robust to heteroskedasticity           Wald chi2(10)   =    2079.47
Deviance             =  209588.6814               Prob > chi2     =     0.0000
Log pseudolikelihood = -118149.5536               Pseudo R2       =     0.3540

Number of clusters (vendor) =        905
Number of clusters (w)      =         51
                                        (Std. Err. adjusted for 51 clusters in vendor w)
----------------------------------------------------------------------------------------
                       |               Robust
           c_neg_count |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          bc_pos_count |   .9214924   .1112899     8.28   0.000     .7033683    1.139617
                   arf |    .459623   .2459217     1.87   0.062    -.0223746    .9416205
          item_count_w |   .0031589    .000815     3.88   0.000     .0015614    .0047563
        sales_volume_w |  -.0000474    .000023    -2.06   0.039    -.0000924   -2.36e-06
international_shipment |   .6218759   .1598638     3.89   0.000     .3085486    .9352033
        has_price_drop |  -.2716393   .1160577    -2.34   0.019    -.4991081   -.0441704
                    me |   .0315235    .039771     0.79   0.428    -.0464263    .1094732
                       |
             c.me#c.me |  -.0024475   .0014197    -1.72   0.085      -.00523    .0003351
                       |
                     w |   .0940781    .015045     6.25   0.000     .0645904    .1235659
                       |
               c.w#c.w |  -.0032242    .000329    -9.80   0.000    -.0038691   -.0025793
                       |
                 _cons |   -.087332   .2095723    -0.42   0.677    -.4980862    .3234222
----------------------------------------------------------------------------------------

.     
. margins, dydx(*)

Average marginal effects                        Number of obs     =     23,682
Model VCE    : Robust

Expression   : Predicted mean of c_neg_count, predict()
dy/dx w.r.t. : bc_pos_count arf item_count_w sales_volume_w international_shipment has_price_drop me w

----------------------------------------------------------------------------------------
                       |            Delta-method
                       |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
          bc_pos_count |   3.005999   .4753171     6.32   0.000     2.074394    3.937603
                   arf |   1.499335   .8108798     1.85   0.064      -.08996     3.08863
          item_count_w |   .0103046   .0029253     3.52   0.000      .004571    .0160381
        sales_volume_w |  -.0001545   .0000821    -1.88   0.060    -.0003155    6.50e-06
international_shipment |    2.02862   .5598321     3.62   0.000     .9313695    3.125871
        has_price_drop |  -.8861139   .3910534    -2.27   0.023    -1.652564   -.1196634
                    me |   .0087548    .075021     0.12   0.907    -.1382837    .1557933
                     w |  -.0429091   .0100046    -4.29   0.000    -.0625178   -.0233005
----------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:   9 Apr 2020, 13:01:59
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
