
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  18 Mar 2020, 18:22:11

. // normalize features
. gen ln_neg_count_min = ln(neg_count_min)

. gen ln_pos_count_min = ln(pos_count_min)

. gen ln_w = ln(w)

. 
. // group items in terciles
. gen items = .
(24,551 missing values generated)

. replace items = 0 if item_count <=13
(8,458 real changes made)

. replace items = 1 if item_count > 13 & item_count <= 32
(8,075 real changes made)

. replace items = 2 if item_count > 32
(8,018 real changes made)

. 
. // group categories in terciles 
. gen categories = .
(24,551 missing values generated)

. replace categories = 0 if category_count <=2
(8,360 real changes made)

. replace categories = 1 if category_count > 2 & category_count <= 4
(9,141 real changes made)

. replace categories = 2 if category_count > 4
(7,050 real changes made)

. 
. recode m_maxw (1/3 = 1) (4/6 = 2) (6/9 = 3) (9/12 = 4), gen(q)
(13257 differences between m_maxw and q)

. 
. melogit has_price_drop                       ///
>         c.ln_neg_count_min##c.arf            ///
>         c.ln_pos_count_min c.ln_w            ///
>         i.q i.items i.categories             ///
>     || vendor: arf, cov(un)

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7929.1508  
Iteration 1:   log likelihood = -7777.6786  
Iteration 2:   log likelihood = -7774.1418  
Iteration 3:   log likelihood = -7774.0969  
Iteration 4:   log likelihood = -7774.0968  

Refining starting values:

Grid node 0:   log likelihood = -7953.7176

Fitting full model:

Iteration 0:   log likelihood = -7953.7176  (not concave)
Iteration 1:   log likelihood = -7943.2977  (not concave)
Iteration 2:   log likelihood = -7933.8822  (not concave)
Iteration 3:   log likelihood = -7902.9776  (not concave)
Iteration 4:   log likelihood =  -7878.193  (not concave)
Iteration 5:   log likelihood = -7875.7183  (not concave)
Iteration 6:   log likelihood = -7875.2234  (not concave)
Iteration 7:   log likelihood = -7875.0255  (not concave)
Iteration 8:   log likelihood = -7874.9464  (not concave)
Iteration 9:   log likelihood = -7874.9147  (not concave)
Iteration 10:  log likelihood = -7874.8894  (not concave)
Iteration 11:  log likelihood = -7874.8843  (not concave)
Iteration 12:  log likelihood = -7874.8843  (not concave)
Iteration 13:  log likelihood = -7874.8842  (not concave)
Iteration 14:  log likelihood = -7874.8842  (not concave)
Iteration 15:  log likelihood = -7874.8842  (not concave)
Iteration 16:  log likelihood = -7874.8842  (not concave)
Iteration 17:  log likelihood = -7874.8842  (not concave)
Iteration 18:  log likelihood = -7874.8842  (not concave)
Iteration 19:  log likelihood = -7855.6762  (not concave)
Iteration 20:  log likelihood = -7840.2813  (not concave)
Iteration 21:  log likelihood =  -7838.745  (not concave)
Iteration 22:  log likelihood = -7837.5166  (not concave)
Iteration 23:  log likelihood = -7837.4553  (not concave)
Iteration 24:  log likelihood =  -7837.443  (not concave)
Iteration 25:  log likelihood = -7837.4418  (not concave)
Iteration 26:  log likelihood = -7837.4408  (not concave)
Iteration 27:  log likelihood = -7837.4407  (not concave)
Iteration 28:  log likelihood = -7837.4406  (not concave)
Iteration 29:  log likelihood = -7837.4406  (not concave)
Iteration 30:  log likelihood = -7837.4406  (not concave)
Iteration 31:  log likelihood = -7837.4406  (not concave)
Iteration 32:  log likelihood = -7837.4406  (not concave)
Iteration 33:  log likelihood = -7837.4406  (not concave)
Iteration 34:  log likelihood = -7837.4406  (not concave)
Iteration 35:  log likelihood = -7837.4406  (not concave)
Iteration 36:  log likelihood = -7837.4406  (not concave)
Iteration 37:  log likelihood = -7837.4406  (not concave)
Iteration 38:  log likelihood = -7837.4406  (not concave)
Iteration 39:  log likelihood = -7837.4406  (not concave)
Iteration 40:  log likelihood = -7837.4406  (not concave)
Iteration 41:  log likelihood = -7837.4406  (not concave)
Iteration 42:  log likelihood = -7837.4406  (not concave)
Iteration 43:  log likelihood = -7837.4406  (not concave)
Iteration 44:  log likelihood = -7837.4406  (not concave)
Iteration 45:  log likelihood = -7837.4406  (not concave)
Iteration 46:  log likelihood = -7837.4406  (not concave)
Iteration 47:  log likelihood = -7837.4406  (not concave)
Iteration 48:  log likelihood = -7837.4406  (not concave)
Iteration 49:  log likelihood = -7837.4406  (not concave)
Iteration 50:  log likelihood = -7837.4406  (not concave)
Iteration 51:  log likelihood = -7837.4406  (not concave)
Iteration 52:  log likelihood = -7837.4406  (not concave)
Iteration 53:  log likelihood = -7837.4406  (not concave)
Iteration 54:  log likelihood = -7833.5078  (not concave)
Iteration 55:  log likelihood = -7833.5077  (not concave)
Iteration 56:  log likelihood = -7833.5077  (not concave)
Iteration 57:  log likelihood = -7833.5077  (not concave)
Iteration 58:  log likelihood = -7833.5077  (not concave)
Iteration 59:  log likelihood = -7833.5077  (not concave)
Iteration 60:  log likelihood = -7833.5077  (not concave)
Iteration 61:  log likelihood = -7833.5077  (not concave)
Iteration 62:  log likelihood = -7833.5077  (not concave)
Iteration 63:  log likelihood = -7833.5077  (not concave)
Iteration 64:  log likelihood = -7833.5077  (not concave)
Iteration 65:  log likelihood = -7833.5077  (not concave)
Iteration 66:  log likelihood = -7833.5077  (not concave)
Iteration 67:  log likelihood = -7833.5077  (not concave)
Iteration 68:  log likelihood = -7833.5077  (not concave)
Iteration 69:  log likelihood = -7833.1017  (not concave)
Iteration 70:  log likelihood = -7833.0815  (not concave)
Iteration 71:  log likelihood = -7833.0733  (not concave)
Iteration 72:  log likelihood = -7833.0725  (not concave)
Iteration 73:  log likelihood = -7833.0722  (not concave)
Iteration 74:  log likelihood =  -7833.072  (not concave)
Iteration 75:  log likelihood =  -7833.072  (not concave)
Iteration 76:  log likelihood = -7833.0719  (not concave)
Iteration 77:  log likelihood = -7833.0719  (not concave)
Iteration 78:  log likelihood = -7833.0719  (not concave)
Iteration 79:  log likelihood = -7833.0719  (not concave)
Iteration 80:  log likelihood = -7833.0719  (not concave)
Iteration 81:  log likelihood = -7833.0719  (not concave)
Iteration 82:  log likelihood = -7833.0719  (not concave)
Iteration 83:  log likelihood = -7833.0719  (not concave)
Iteration 84:  log likelihood = -7833.0719  (not concave)
Iteration 85:  log likelihood = -7832.7337  (not concave)
Iteration 86:  log likelihood = -7832.4632  (not concave)
Iteration 87:  log likelihood = -7832.4091  (not concave)
Iteration 88:  log likelihood = -7832.3983  (not concave)
Iteration 89:  log likelihood = -7832.3962  (not concave)
Iteration 90:  log likelihood = -7832.3961  (not concave)
Iteration 91:  log likelihood =  -7832.396  (not concave)
Iteration 92:  log likelihood =  -7832.396  (not concave)
Iteration 93:  log likelihood =  -7832.396  (not concave)
Iteration 94:  log likelihood =  -7832.396  (not concave)
Iteration 95:  log likelihood =  -7832.396  (not concave)
Iteration 96:  log likelihood =  -7832.396  (not concave)
Iteration 97:  log likelihood =  -7832.396  (not concave)
Iteration 98:  log likelihood =  -7832.396  (not concave)
Iteration 99:  log likelihood = -7804.1021  (not concave)
Iteration 100: log likelihood = -7804.1007  (not concave)
Iteration 101: log likelihood = -7804.1004  (not concave)
Iteration 102: log likelihood = -7804.1003  (not concave)
Iteration 103: log likelihood = -7804.1002  (not concave)
Iteration 104: log likelihood = -7804.1002  (not concave)
Iteration 105: log likelihood = -7804.1002  (not concave)
Iteration 106: log likelihood = -7804.1002  (not concave)
Iteration 107: log likelihood = -7804.1002  (not concave)
Iteration 108: log likelihood = -7804.1002  (not concave)
Iteration 109: log likelihood = -7804.1002  (not concave)
Iteration 110: log likelihood = -7804.1002  (backed up)
Iteration 111: log likelihood = -7804.1002  (not concave)
Iteration 112: log likelihood = -7804.1002  (not concave)
Iteration 113: log likelihood = -7804.1002  (not concave)
Iteration 114: log likelihood = -7804.1002  (not concave)
Iteration 115: log likelihood = -7804.1002  (not concave)
Iteration 116: log likelihood = -7804.1002  (not concave)
Iteration 117: log likelihood = -7804.1002  (not concave)
Iteration 118: log likelihood = -7804.1002  (not concave)
Iteration 119: log likelihood = -7804.1002  (not concave)
Iteration 120: log likelihood = -7804.1002  (not concave)
Iteration 121: log likelihood = -7804.1002  (not concave)
Iteration 122: log likelihood = -7804.1002  (not concave)
Iteration 123: log likelihood = -7804.1002  (not concave)
Iteration 124: log likelihood = -7804.1002  (backed up)
Iteration 125: log likelihood = -7796.7927  (not concave)
Iteration 126: log likelihood = -7796.7927  (not concave)
Iteration 127: log likelihood = -7796.7927  (backed up)
Iteration 128: log likelihood = -7781.8843  (not concave)
Iteration 129: log likelihood = -7778.6495  (not concave)
Iteration 130: log likelihood = -7777.3474  (not concave)
Iteration 131: log likelihood = -7776.2876  (not concave)
Iteration 132: log likelihood = -7776.0748  (not concave)
Iteration 133: log likelihood = -7775.9893  (not concave)
Iteration 134: log likelihood = -7775.9551  (not concave)
Iteration 135: log likelihood = -7775.9482  (not concave)
Iteration 136: log likelihood = -7775.9479  (not concave)
Iteration 137: log likelihood = -7775.9477  (not concave)
Iteration 138: log likelihood = -7775.9476  (not concave)
Iteration 139: log likelihood = -7775.9476  (not concave)
Iteration 140: log likelihood = -7775.9476  (not concave)
Iteration 141: log likelihood = -7775.9476  (not concave)
Iteration 142: log likelihood = -7775.9476  (not concave)
Iteration 143: log likelihood = -7775.9476  (not concave)
Iteration 144: log likelihood = -7775.9476  (not concave)
Iteration 145: log likelihood = -7775.9476  (not concave)
Iteration 146: log likelihood = -7775.9476  (not concave)
Iteration 147: log likelihood = -7775.9476  (not concave)
Iteration 148: log likelihood = -7775.9476  (not concave)
Iteration 149: log likelihood = -7775.9476  (backed up)
Iteration 150: log likelihood = -7775.9476  (not concave)
Iteration 151: log likelihood = -7775.9476  (not concave)
Iteration 152: log likelihood = -7775.9476  (not concave)
Iteration 153: log likelihood = -7775.9476  (not concave)
Iteration 154: log likelihood = -7775.9476  (not concave)
Iteration 155: log likelihood = -7775.9476  (not concave)
Iteration 156: log likelihood = -7775.9476  (not concave)
Iteration 157: log likelihood = -7775.9476  (not concave)
Iteration 158: log likelihood = -7775.9476  (not concave)
Iteration 159: log likelihood = -7775.9476  (not concave)
Iteration 160: log likelihood = -7775.9476  (not concave)
Iteration 161: log likelihood = -7775.9476  (not concave)
Iteration 162: log likelihood = -7775.9476  (not concave)
Iteration 163: log likelihood = -7775.9476  (not concave)
Iteration 164: log likelihood = -7775.9476  (not concave)
Iteration 165: log likelihood = -7775.9476  (not concave)
Iteration 166: log likelihood = -7775.9476  (not concave)
Iteration 167: log likelihood = -7775.9476  (not concave)
Iteration 168: log likelihood = -7775.9476  (not concave)
Iteration 169: log likelihood = -7775.9476  (not concave)
Iteration 170: log likelihood = -7775.9476  (not concave)
Iteration 171: log likelihood = -7775.9476  (not concave)
Iteration 172: log likelihood = -7775.9476  (not concave)
Iteration 173: log likelihood = -7775.9476  (not concave)
Iteration 174: log likelihood = -7775.9476  (not concave)
Iteration 175: log likelihood = -7775.9476  (not concave)
Iteration 176: log likelihood = -7775.9476  (not concave)
Iteration 177: log likelihood = -7775.9476  (not concave)
Iteration 178: log likelihood = -7775.9476  (not concave)
Iteration 179: log likelihood = -7775.9476  (not concave)
Iteration 180: log likelihood = -7775.9476  (not concave)
Iteration 181: log likelihood = -7775.9476  (not concave)
Iteration 182: log likelihood = -7775.9476  (not concave)
Iteration 183: log likelihood = -7775.9476  (not concave)
Iteration 184: log likelihood = -7775.9476  (not concave)
Iteration 185: log likelihood = -7775.9476  (not concave)
Iteration 186: log likelihood = -7775.3019  (not concave)
Iteration 187: log likelihood = -7775.3019  (not concave)
Iteration 188: log likelihood = -7775.3019  (not concave)
Iteration 189: log likelihood = -7775.3019  (not concave)
Iteration 190: log likelihood = -7775.3019  (not concave)
Iteration 191: log likelihood = -7775.3019  (not concave)
Iteration 192: log likelihood = -7775.3019  (not concave)
Iteration 193: log likelihood = -7775.3019  (not concave)
Iteration 194: log likelihood = -7775.3019  (not concave)
Iteration 195: log likelihood = -7775.3019  (not concave)
Iteration 196: log likelihood = -7775.3019  (not concave)
Iteration 197: log likelihood = -7775.3019  (not concave)
Iteration 198: log likelihood = -7775.3019  (not concave)
Iteration 199: log likelihood = -7775.3019  (not concave)
Iteration 200: log likelihood = -7775.3019  (not concave)
Iteration 201: log likelihood = -7775.3019  (not concave)
Iteration 202: log likelihood = -7774.9442  (not concave)
Iteration 203: log likelihood = -7774.9442  (not concave)
Iteration 204: log likelihood = -7774.9442  (not concave)
Iteration 205: log likelihood = -7774.9442  (not concave)
Iteration 206: log likelihood = -7774.9442  (not concave)
Iteration 207: log likelihood = -7774.9442  (not concave)
Iteration 208: log likelihood = -7774.9442  (not concave)
Iteration 209: log likelihood = -7774.9442  (not concave)
Iteration 210: log likelihood = -7773.8921  (not concave)
Iteration 211: log likelihood = -7773.8658  (not concave)
Iteration 212: log likelihood = -7773.8552  (not concave)
Iteration 213: log likelihood =  -7773.851  (not concave)
Iteration 214: log likelihood = -7773.8505  (not concave)
Iteration 215: log likelihood = -7773.8505  (not concave)
Iteration 216: log likelihood = -7773.8505  (not concave)
Iteration 217: log likelihood = -7773.8505  (not concave)
Iteration 218: log likelihood = -7773.8505  (not concave)
Iteration 219: log likelihood = -7773.8505  (not concave)
Iteration 220: log likelihood = -7773.8505  (backed up)
Iteration 221: log likelihood = -7773.8505  (not concave)
Iteration 222: log likelihood = -7773.8505  (not concave)
Iteration 223: log likelihood = -7773.8505  (not concave)
Iteration 224: log likelihood = -7773.8505  (not concave)
Iteration 225: log likelihood = -7773.8505  (not concave)
Iteration 226: log likelihood = -7773.8505  (not concave)
Iteration 227: log likelihood = -7773.8505  (not concave)
Iteration 228: log likelihood = -7773.8505  (not concave)
Iteration 229: log likelihood = -7773.8505  (not concave)
Iteration 230: log likelihood = -7773.8505  (not concave)
Iteration 231: log likelihood = -7773.8505  (not concave)
Iteration 232: log likelihood = -7773.8505  (not concave)
Iteration 233: log likelihood = -7773.8505  (not concave)
Iteration 234: log likelihood = -7773.8505  (not concave)
Iteration 235: log likelihood = -7773.8505  (not concave)
Iteration 236: log likelihood = -7773.8505  (not concave)
Iteration 237: log likelihood = -7773.8505  (not concave)
Iteration 238: log likelihood = -7773.8505  (not concave)
Iteration 239: log likelihood = -7773.8505  (not concave)
Iteration 240: log likelihood = -7773.8505  (not concave)
Iteration 241: log likelihood = -7773.8505  (not concave)
Iteration 242: log likelihood = -7773.8505  (not concave)
Iteration 243: log likelihood = -7773.8505  (not concave)
Iteration 244: log likelihood = -7773.8505  (not concave)
Iteration 245: log likelihood = -7773.8505  (not concave)
Iteration 246: log likelihood = -7773.8505  (not concave)
Iteration 247: log likelihood = -7773.8505  (not concave)
Iteration 248: log likelihood = -7773.8505  (not concave)
Iteration 249: log likelihood = -7773.8505  (not concave)
Iteration 250: log likelihood = -7773.8505  (not concave)
Iteration 251: log likelihood = -7773.8505  (not concave)
Iteration 252: log likelihood = -7773.8505  (not concave)
Iteration 253: log likelihood = -7773.8505  (not concave)
Iteration 254: log likelihood = -7773.8505  (not concave)
Iteration 255: log likelihood = -7773.8505  (not concave)
Iteration 256: log likelihood = -7773.8505  (not concave)
Iteration 257: log likelihood = -7773.8505  (not concave)
Iteration 258: log likelihood = -7773.8505  (not concave)
Iteration 259: log likelihood = -7773.8505  (not concave)
Iteration 260: log likelihood = -7773.8505  (not concave)
Iteration 261: log likelihood = -7773.8505  (not concave)
Iteration 262: log likelihood = -7773.8505  (not concave)
Iteration 263: log likelihood = -7773.8505  (not concave)
Iteration 264: log likelihood = -7773.8505  (not concave)
Iteration 265: log likelihood = -7773.8505  (not concave)
Iteration 266: log likelihood = -7773.8505  (not concave)
Iteration 267: log likelihood = -7773.8505  (not concave)
Iteration 268: log likelihood = -7773.8505  (not concave)
Iteration 269: log likelihood = -7773.8505  (not concave)
Iteration 270: log likelihood = -7773.8505  (not concave)
Iteration 271: log likelihood = -7773.8505  (not concave)
Iteration 272: log likelihood = -7773.8505  (not concave)
Iteration 273: log likelihood = -7773.8505  (not concave)
Iteration 274: log likelihood = -7773.8505  (not concave)
Iteration 275: log likelihood = -7773.8505  (not concave)
Iteration 276: log likelihood = -7773.8505  (not concave)
Iteration 277: log likelihood = -7773.8505  (not concave)
Iteration 278: log likelihood = -7773.8505  (not concave)
Iteration 279: log likelihood = -7773.8505  (not concave)
Iteration 280: log likelihood = -7773.8505  (not concave)
Iteration 281: log likelihood = -7773.8505  (not concave)
Iteration 282: log likelihood = -7773.8505  (not concave)
Iteration 283: log likelihood = -7773.8505  (not concave)
Iteration 284: log likelihood = -7773.8505  (not concave)
Iteration 285: log likelihood = -7773.8505  (not concave)
Iteration 286: log likelihood = -7773.8505  (not concave)
Iteration 287: log likelihood = -7773.8505  (not concave)
Iteration 288: log likelihood = -7773.8505  (not concave)
Iteration 289: log likelihood = -7773.8505  (not concave)
Iteration 290: log likelihood = -7773.8505  (not concave)
Iteration 291: log likelihood = -7773.8505  (not concave)
Iteration 292: log likelihood = -7773.8505  (not concave)
Iteration 293: log likelihood = -7773.8505  (not concave)
Iteration 294: log likelihood = -7773.8505  (not concave)
Iteration 295: log likelihood = -7773.8505  (not concave)
Iteration 296: log likelihood = -7773.8505  (not concave)
Iteration 297: log likelihood = -7773.8505  (not concave)
Iteration 298: log likelihood = -7773.8505  (not concave)
Iteration 299: log likelihood = -7773.8505  (not concave)
Iteration 300: log likelihood = -7773.8505  (not concave)
Iteration 301: log likelihood = -7773.8505  (not concave)
Iteration 302: log likelihood = -7773.8505  (not concave)
Iteration 303: log likelihood = -7773.8505  (not concave)
Iteration 304: log likelihood = -7773.8505  (not concave)
Iteration 305: log likelihood = -7773.8505  (not concave)
Iteration 306: log likelihood = -7773.8505  (not concave)
Iteration 307: log likelihood = -7773.8505  (not concave)
Iteration 308: log likelihood = -7773.8505  (not concave)
Iteration 309: log likelihood = -7773.8505  (not concave)
Iteration 310: log likelihood = -7773.8505  (not concave)
Iteration 311: log likelihood = -7773.8505  (not concave)
Iteration 312: log likelihood = -7773.8505  (not concave)
Iteration 313: log likelihood = -7773.8505  (not concave)
Iteration 314: log likelihood = -7773.8505  (not concave)
Iteration 315: log likelihood = -7773.8505  (not concave)
Iteration 316: log likelihood = -7773.8505  (not concave)
Iteration 317: log likelihood = -7773.8505  (not concave)
Iteration 318: log likelihood = -7773.8505  (not concave)
Iteration 319: log likelihood = -7773.8505  (not concave)
Iteration 320: log likelihood = -7773.8505  (not concave)
Iteration 321: log likelihood = -7773.8505  (not concave)
Iteration 322: log likelihood = -7773.8505  (not concave)
Iteration 323: log likelihood = -7773.8505  (not concave)
Iteration 324: log likelihood = -7773.8505  (not concave)
Iteration 325: log likelihood = -7773.8505  (not concave)
Iteration 326: log likelihood = -7773.8505  (backed up)
Iteration 327: log likelihood = -7773.8505  (not concave)
Iteration 328: log likelihood = -7773.8505  (not concave)
Iteration 329: log likelihood = -7773.8505  (not concave)
Iteration 330: log likelihood = -7773.8505  (not concave)
Iteration 331: log likelihood = -7773.8505  (not concave)
Iteration 332: log likelihood = -7773.8505  (not concave)
Iteration 333: log likelihood = -7773.8505  (not concave)
Iteration 334: log likelihood = -7773.8505  (not concave)
Iteration 335: log likelihood = -7773.8505  (not concave)
Iteration 336: log likelihood = -7773.8505  (not concave)
Iteration 337: log likelihood = -7773.8505  (not concave)
Iteration 338: log likelihood = -7773.8505  (not concave)
Iteration 339: log likelihood = -7773.8505  (not concave)
Iteration 340: log likelihood = -7773.8505  (not concave)
Iteration 341: log likelihood = -7773.8505  (backed up)
Iteration 342: log likelihood = -7773.8505  (not concave)
Iteration 343: log likelihood = -7773.5057  (not concave)
Iteration 344: log likelihood = -7773.5057  (not concave)
Iteration 345: log likelihood = -7773.5057  (not concave)
Iteration 346: log likelihood = -7773.5057  (not concave)
Iteration 347: log likelihood = -7773.5057  (backed up)
Iteration 348: log likelihood = -7773.5057  (not concave)
Iteration 349: log likelihood = -7773.5057  (not concave)
Iteration 350: log likelihood = -7773.5057  (not concave)
Iteration 351: log likelihood = -7773.5057  (not concave)
Iteration 352: log likelihood = -7773.5057  (not concave)
Iteration 353: log likelihood = -7773.5057  (not concave)
Iteration 354: log likelihood = -7773.5057  (not concave)
Iteration 355: log likelihood = -7773.5057  (not concave)
Iteration 356: log likelihood = -7773.5057  (not concave)
Iteration 357: log likelihood = -7773.5057  (not concave)
Iteration 358: log likelihood = -7773.5057  (not concave)
Iteration 359: log likelihood = -7773.5057  (not concave)
Iteration 360: log likelihood = -7773.5057  (not concave)
Iteration 361: log likelihood = -7773.5057  (not concave)
Iteration 362: log likelihood = -7773.5057  (not concave)
Iteration 363: log likelihood = -7773.5057  (not concave)
Iteration 364: log likelihood = -7773.5057  (not concave)
Iteration 365: log likelihood = -7773.5057  (not concave)
Iteration 366: log likelihood = -7773.5057  (not concave)
Iteration 367: log likelihood = -7773.5057  (not concave)
Iteration 368: log likelihood = -7773.5057  (not concave)
Iteration 369: log likelihood = -7773.5057  (not concave)
Iteration 370: log likelihood = -7773.5057  (not concave)
Iteration 371: log likelihood = -7773.5057  (not concave)
Iteration 372: log likelihood = -7773.5057  (not concave)
Iteration 373: log likelihood = -7773.5057  (not concave)
Iteration 374: log likelihood = -7773.5057  (not concave)
Iteration 375: log likelihood = -7773.5057  (not concave)
Iteration 376: log likelihood = -7773.5057  (not concave)
Iteration 377: log likelihood = -7773.5057  (not concave)
Iteration 378: log likelihood = -7773.5057  (not concave)
Iteration 379: log likelihood = -7773.5057  (not concave)
Iteration 380: log likelihood = -7773.5057  (not concave)
Iteration 381: log likelihood = -7773.5057  (not concave)
Iteration 382: log likelihood = -7773.5057  (not concave)
Iteration 383: log likelihood = -7773.5057  (not concave)
Iteration 384: log likelihood = -7773.5057  (not concave)
Iteration 385: log likelihood = -7773.5057  (not concave)
Iteration 386: log likelihood = -7773.5057  (not concave)
Iteration 387: log likelihood = -7773.5057  (not concave)
Iteration 388: log likelihood = -7773.5057  (not concave)
Iteration 389: log likelihood = -7773.5057  (not concave)
Iteration 390: log likelihood = -7773.5057  (not concave)
Iteration 391: log likelihood = -7773.5057  (not concave)
Iteration 392: log likelihood = -7773.5057  (not concave)
Iteration 393: log likelihood = -7773.5057  (not concave)
Iteration 394: log likelihood = -7773.5057  (not concave)
Iteration 395: log likelihood = -7773.5057  (not concave)
Iteration 396: log likelihood = -7773.5057  (not concave)
Iteration 397: log likelihood = -7773.5057  (not concave)
Iteration 398: log likelihood = -7773.5057  (not concave)
Iteration 399: log likelihood = -7773.5057  (not concave)
Iteration 400: log likelihood = -7773.5057  (not concave)
Iteration 401: log likelihood = -7773.5057  (not concave)
Iteration 402: log likelihood = -7773.5057  (not concave)
Iteration 403: log likelihood = -7773.5057  (not concave)
Iteration 404: log likelihood = -7773.5057  (not concave)
Iteration 405: log likelihood = -7773.5057  (not concave)
Iteration 406: log likelihood = -7773.5057  (not concave)
Iteration 407: log likelihood = -7773.5057  (not concave)
Iteration 408: log likelihood = -7773.5057  (not concave)
Iteration 409: log likelihood = -7773.5057  (not concave)
Iteration 410: log likelihood = -7773.5057  (not concave)
Iteration 411: log likelihood = -7773.5057  (not concave)
Iteration 412: log likelihood = -7773.5057  (not concave)
Iteration 413: log likelihood = -7773.5057  (not concave)
Iteration 414: log likelihood = -7773.5057  (not concave)
Iteration 415: log likelihood = -7773.5057  (not concave)
Iteration 416: log likelihood = -7773.5057  (not concave)
Iteration 417: log likelihood = -7773.5057  (not concave)
Iteration 418: log likelihood = -7773.5057  (not concave)
Iteration 419: log likelihood = -7773.5057  (not concave)
Iteration 420: log likelihood = -7773.5057  (not concave)
Iteration 421: log likelihood = -7773.5057  (not concave)
Iteration 422: log likelihood = -7773.5057  (not concave)
Iteration 423: log likelihood = -7773.5057  (not concave)
Iteration 424: log likelihood = -7773.5057  (not concave)
Iteration 425: log likelihood = -7773.5057  (not concave)
Iteration 426: log likelihood = -7773.5057  (not concave)
Iteration 427: log likelihood = -7773.5057  (not concave)
Iteration 428: log likelihood = -7773.5057  (not concave)
Iteration 429: log likelihood = -7773.5057  (not concave)
Iteration 430: log likelihood = -7773.5057  (not concave)
Iteration 431: log likelihood = -7773.5057  (not concave)
Iteration 432: log likelihood = -7773.5057  (not concave)
Iteration 433: log likelihood = -7773.5057  (not concave)
Iteration 434: log likelihood = -7773.5057  (not concave)
Iteration 435: log likelihood = -7773.5057  (not concave)
Iteration 436: log likelihood = -7773.5057  (not concave)
Iteration 437: log likelihood = -7773.5057  (not concave)
Iteration 438: log likelihood = -7773.5057  (not concave)
Iteration 439: log likelihood = -7773.5057  (not concave)
Iteration 440: log likelihood = -7773.5057  (not concave)
Iteration 441: log likelihood = -7773.5057  (not concave)
Iteration 442: log likelihood = -7773.5057  (not concave)
Iteration 443: log likelihood = -7773.5057  (not concave)
Iteration 444: log likelihood = -7773.5057  (not concave)
Iteration 445: log likelihood = -7773.5057  (not concave)
Iteration 446: log likelihood = -7773.5057  (not concave)
Iteration 447: log likelihood = -7773.5057  (not concave)
Iteration 448: log likelihood = -7773.5057  (not concave)
Iteration 449: log likelihood = -7773.5057  (not concave)
Iteration 450: log likelihood = -7773.5057  (not concave)
Iteration 451: log likelihood = -7773.5057  (not concave)
Iteration 452: log likelihood = -7773.5057  (not concave)
Iteration 453: log likelihood = -7773.5057  (not concave)
Iteration 454: log likelihood = -7773.5057  (not concave)
Iteration 455: log likelihood = -7773.5057  (not concave)
Iteration 456: log likelihood = -7773.5057  (not concave)
Iteration 457: log likelihood = -7773.5057  (not concave)
Iteration 458: log likelihood = -7773.5057  (not concave)
Iteration 459: log likelihood = -7773.5057  (not concave)
Iteration 460: log likelihood = -7773.5057  (not concave)
Iteration 461: log likelihood = -7773.5057  (not concave)
Iteration 462: log likelihood = -7773.5057  (not concave)
Iteration 463: log likelihood = -7773.5057  (not concave)
Iteration 464: log likelihood = -7773.5057  (not concave)
Iteration 465: log likelihood = -7773.5057  (not concave)
Iteration 466: log likelihood = -7773.5057  (not concave)
Iteration 467: log likelihood = -7773.5057  (not concave)
Iteration 468: log likelihood = -7773.5057  (not concave)
Iteration 469: log likelihood = -7773.5057  (not concave)
Iteration 470: log likelihood = -7773.5057  (not concave)
Iteration 471: log likelihood = -7773.5057  (not concave)
Iteration 472: log likelihood = -7773.5057  (not concave)
Iteration 473: log likelihood = -7773.5057  (not concave)
Iteration 474: log likelihood = -7773.5057  (not concave)
Iteration 475: log likelihood = -7773.5057  (not concave)
Iteration 476: log likelihood = -7773.5057  (not concave)
Iteration 477: log likelihood = -7773.5057  (not concave)
Iteration 478: log likelihood = -7773.5057  (not concave)
Iteration 479: log likelihood = -7773.5057  (not concave)
Iteration 480: log likelihood = -7773.5057  (not concave)
Iteration 481: log likelihood = -7773.5057  (not concave)
Iteration 482: log likelihood = -7773.5057  (not concave)
Iteration 483: log likelihood = -7773.5057  (not concave)
Iteration 484: log likelihood = -7773.5057  (not concave)
Iteration 485: log likelihood = -7773.5057  (not concave)
Iteration 486: log likelihood = -7773.5057  (not concave)
Iteration 487: log likelihood = -7773.5057  (not concave)
Iteration 488: log likelihood = -7773.5057  (not concave)
Iteration 489: log likelihood = -7773.5057  (not concave)
Iteration 490: log likelihood = -7773.5057  (not concave)
Iteration 491: log likelihood = -7773.5057  (not concave)
Iteration 492: log likelihood = -7773.5057  (not concave)
Iteration 493: log likelihood = -7773.5057  (not concave)
Iteration 494: log likelihood = -7773.5057  (not concave)
Iteration 495: log likelihood = -7773.5057  (not concave)
Iteration 496: log likelihood = -7773.5057  (not concave)
Iteration 497: log likelihood = -7773.5057  (not concave)
Iteration 498: log likelihood = -7773.5057  (not concave)
Iteration 499: log likelihood = -7773.5057  (not concave)
Iteration 500: log likelihood = -7773.5057  (not concave)
Iteration 501: log likelihood = -7773.5057  (not concave)
Iteration 502: log likelihood = -7773.5057  (not concave)
Iteration 503: log likelihood = -7773.5057  (not concave)
Iteration 504: log likelihood = -7773.5057  (not concave)
Iteration 505: log likelihood = -7773.5057  (not concave)
Iteration 506: log likelihood = -7773.5057  (not concave)
Iteration 507: log likelihood = -7773.5057  (not concave)
Iteration 508: log likelihood = -7773.5057  (not concave)
Iteration 509: log likelihood = -7773.5057  (not concave)
Iteration 510: log likelihood = -7773.5057  (not concave)
Iteration 511: log likelihood = -7773.5057  (not concave)
Iteration 512: log likelihood = -7773.5057  (not concave)
Iteration 513: log likelihood = -7773.5057  (not concave)
Iteration 514: log likelihood = -7773.5057  (not concave)
Iteration 515: log likelihood = -7773.5057  (not concave)
Iteration 516: log likelihood = -7773.5057  (not concave)
Iteration 517: log likelihood = -7773.5057  (not concave)
Iteration 518: log likelihood = -7773.5057  (not concave)
Iteration 519: log likelihood = -7773.5057  (not concave)
Iteration 520: log likelihood = -7773.5057  (not concave)
Iteration 521: log likelihood = -7773.5057  (not concave)
Iteration 522: log likelihood = -7773.5057  (not concave)
Iteration 523: log likelihood = -7773.5057  (not concave)
Iteration 524: log likelihood = -7773.5057  (not concave)
Iteration 525: log likelihood = -7773.5057  (not concave)
Iteration 526: log likelihood = -7773.5057  (not concave)
Iteration 527: log likelihood = -7773.5057  (not concave)
Iteration 528: log likelihood = -7773.5057  (not concave)
Iteration 529: log likelihood = -7773.5057  (not concave)
Iteration 530: log likelihood = -7773.5057  (not concave)
Iteration 531: log likelihood = -7773.5057  (not concave)
Iteration 532: log likelihood = -7773.5057  (not concave)
Iteration 533: log likelihood = -7773.5057  (not concave)
Iteration 534: log likelihood = -7773.5057  (not concave)
Iteration 535: log likelihood = -7773.5057  (not concave)
Iteration 536: log likelihood = -7773.5057  (not concave)
Iteration 537: log likelihood = -7773.5057  (not concave)
Iteration 538: log likelihood = -7773.5057  (not concave)
Iteration 539: log likelihood = -7773.5057  (not concave)
Iteration 540: log likelihood = -7773.5057  (not concave)
Iteration 541: log likelihood = -7773.5057  (not concave)
Iteration 542: log likelihood = -7773.5057  (not concave)
Iteration 543: log likelihood = -7773.5057  (not concave)
Iteration 544: log likelihood = -7773.5057  (not concave)
Iteration 545: log likelihood = -7773.5057  (not concave)
Iteration 546: log likelihood = -7773.5057  (not concave)
Iteration 547: log likelihood = -7773.5057  (not concave)
Iteration 548: log likelihood = -7773.5057  (not concave)
Iteration 549: log likelihood = -7773.5057  (not concave)
Iteration 550: log likelihood = -7773.5057  (not concave)
Iteration 551: log likelihood = -7773.5057  (not concave)
Iteration 552: log likelihood = -7773.5057  (not concave)
Iteration 553: log likelihood = -7773.5057  (not concave)
Iteration 554: log likelihood = -7773.5057  (not concave)
Iteration 555: log likelihood = -7773.5057  (not concave)
Iteration 556: log likelihood = -7773.5057  (not concave)
Iteration 557: log likelihood = -7773.5057  (not concave)
Iteration 558: log likelihood = -7773.5057  (not concave)
Iteration 559: log likelihood = -7773.5057  (not concave)
Iteration 560: log likelihood = -7773.5057  (not concave)
Iteration 561: log likelihood = -7773.5057  (not concave)
Iteration 562: log likelihood = -7773.5057  (not concave)
Iteration 563: log likelihood = -7773.5057  (not concave)
Iteration 564: log likelihood = -7773.5057  (not concave)
Iteration 565: log likelihood = -7773.5057  (not concave)
Iteration 566: log likelihood = -7773.5057  (not concave)
Iteration 567: log likelihood = -7773.5057  (not concave)
Iteration 568: log likelihood = -7773.5057  (not concave)
Iteration 569: log likelihood = -7773.5057  (not concave)
Iteration 570: log likelihood = -7773.5057  (not concave)
Iteration 571: log likelihood = -7773.5057  (not concave)
Iteration 572: log likelihood = -7773.5057  (not concave)
Iteration 573: log likelihood = -7773.5057  (not concave)
Iteration 574: log likelihood = -7773.5057  (not concave)
Iteration 575: log likelihood = -7773.5057  (not concave)
Iteration 576: log likelihood = -7773.5057  (not concave)
Iteration 577: log likelihood = -7773.5057  (not concave)
Iteration 578: log likelihood = -7773.5057  (not concave)
Iteration 579: log likelihood = -7773.5057  (not concave)
Iteration 580: log likelihood = -7773.5057  (not concave)
Iteration 581: log likelihood = -7773.5057  (not concave)
Iteration 582: log likelihood = -7773.5057  (not concave)
Iteration 583: log likelihood = -7773.5057  (not concave)
Iteration 584: log likelihood = -7773.5057  (not concave)
Iteration 585: log likelihood = -7773.5057  (not concave)
Iteration 586: log likelihood = -7773.5057  (not concave)
Iteration 587: log likelihood = -7773.5057  (not concave)
Iteration 588: log likelihood = -7773.5057  (not concave)
Iteration 589: log likelihood = -7773.5057  (not concave)
Iteration 590: log likelihood = -7773.5057  (not concave)
Iteration 591: log likelihood = -7773.5057  (not concave)
Iteration 592: log likelihood = -7773.5057  (not concave)
Iteration 593: log likelihood = -7773.5057  (not concave)
Iteration 594: log likelihood = -7773.5057  (not concave)
Iteration 595: log likelihood = -7773.5057  (not concave)
Iteration 596: log likelihood = -7773.5057  (not concave)
Iteration 597: log likelihood = -7773.5057  (not concave)
Iteration 598: log likelihood = -7773.5057  (not concave)
Iteration 599: log likelihood = -7773.5057  (not concave)
Iteration 600: log likelihood = -7773.5057  (not concave)
Iteration 601: log likelihood = -7773.5057  (not concave)
Iteration 602: log likelihood = -7773.5057  (not concave)
Iteration 603: log likelihood = -7773.5057  (not concave)
Iteration 604: log likelihood = -7773.5057  (not concave)
Iteration 605: log likelihood = -7773.5057  (not concave)
Iteration 606: log likelihood = -7773.5057  (not concave)
Iteration 607: log likelihood = -7773.5057  (not concave)
Iteration 608: log likelihood = -7773.5057  (not concave)
Iteration 609: log likelihood = -7773.5057  (not concave)
Iteration 610: log likelihood = -7773.5057  (not concave)
Iteration 611: log likelihood = -7773.5057  (not concave)
Iteration 612: log likelihood = -7773.5057  (not concave)
Iteration 613: log likelihood = -7773.5057  (not concave)
Iteration 614: log likelihood = -7773.5057  (not concave)
Iteration 615: log likelihood = -7773.5057  (not concave)
Iteration 616: log likelihood = -7773.5057  (not concave)
Iteration 617: log likelihood = -7773.5057  (not concave)
Iteration 618: log likelihood = -7773.5057  (not concave)
Iteration 619: log likelihood = -7773.5057  (not concave)
Iteration 620: log likelihood = -7773.5057  (not concave)
Iteration 621: log likelihood = -7773.5057  (not concave)
Iteration 622: log likelihood = -7773.5057  (not concave)
Iteration 623: log likelihood = -7773.5057  (not concave)
Iteration 624: log likelihood = -7773.5057  (not concave)
Iteration 625: log likelihood = -7773.5057  (not concave)
Iteration 626: log likelihood = -7773.5057  (not concave)
Iteration 627: log likelihood = -7773.5057  (not concave)
Iteration 628: log likelihood = -7773.5057  (not concave)
Iteration 629: log likelihood = -7773.5057  (not concave)
Iteration 630: log likelihood = -7773.5057  (not concave)
Iteration 631: log likelihood = -7773.5057  (not concave)
Iteration 632: log likelihood = -7773.5057  (not concave)
Iteration 633: log likelihood = -7773.5057  (not concave)
Iteration 634: log likelihood = -7773.5057  (not concave)
Iteration 635: log likelihood = -7773.5057  (not concave)
Iteration 636: log likelihood = -7773.5057  (not concave)
Iteration 637: log likelihood = -7773.5057  (not concave)
Iteration 638: log likelihood = -7773.5057  (not concave)
Iteration 639: log likelihood = -7773.5057  (not concave)
Iteration 640: log likelihood = -7773.5057  (not concave)
Iteration 641: log likelihood = -7773.5057  (not concave)
Iteration 642: log likelihood = -7773.5057  (not concave)
Iteration 643: log likelihood = -7773.5057  (not concave)
Iteration 644: log likelihood = -7773.5057  (not concave)
Iteration 645: log likelihood =  -7773.461  (not concave)
Iteration 646: log likelihood =  -7773.461  (not concave)
Iteration 647: log likelihood =  -7773.461  (not concave)
Iteration 648: log likelihood =  -7773.461  (not concave)
Iteration 649: log likelihood =  -7773.461  (not concave)
Iteration 650: log likelihood =  -7773.461  (not concave)
Iteration 651: log likelihood =  -7773.461  (not concave)
Iteration 652: log likelihood =  -7773.461  (not concave)
Iteration 653: log likelihood =  -7773.461  (backed up)
Iteration 654: log likelihood =  -7773.461  (not concave)
Iteration 655: log likelihood =  -7773.461  (not concave)
Iteration 656: log likelihood =  -7773.461  (not concave)
Iteration 657: log likelihood =  -7773.461  (not concave)
Iteration 658: log likelihood =  -7773.461  (not concave)
Iteration 659: log likelihood =  -7773.461  (not concave)
Iteration 660: log likelihood =  -7773.461  (not concave)
Iteration 661: log likelihood =  -7773.461  (not concave)
Iteration 662: log likelihood =  -7773.461  (not concave)
Iteration 663: log likelihood =  -7773.461  (not concave)
Iteration 664: log likelihood =  -7773.461  (not concave)
Iteration 665: log likelihood =  -7773.461  (not concave)
Iteration 666: log likelihood =  -7773.461  (not concave)
Iteration 667: log likelihood =  -7773.461  (not concave)
Iteration 668: log likelihood =  -7773.461  (not concave)
Iteration 669: log likelihood =  -7773.461  (backed up)
Iteration 670: log likelihood =  -7773.461  (not concave)
Iteration 671: log likelihood =  -7773.461  (not concave)
Iteration 672: log likelihood =  -7773.461  (not concave)
Iteration 673: log likelihood =  -7773.461  (not concave)
Iteration 674: log likelihood =  -7773.461  (not concave)
Iteration 675: log likelihood =  -7773.461  (not concave)
Iteration 676: log likelihood =  -7773.461  (not concave)
Iteration 677: log likelihood =  -7773.461  (not concave)
Iteration 678: log likelihood =  -7773.461  (not concave)
Iteration 679: log likelihood =  -7773.461  (not concave)
Iteration 680: log likelihood =  -7773.461  (not concave)
Iteration 681: log likelihood =  -7773.461  (not concave)
Iteration 682: log likelihood =  -7773.461  (not concave)
Iteration 683: log likelihood =  -7773.461  (not concave)
Iteration 684: log likelihood =  -7773.461  (not concave)
Iteration 685: log likelihood =  -7773.461  (not concave)
Iteration 686: log likelihood =  -7773.461  (not concave)
Iteration 687: log likelihood =  -7773.461  (not concave)
Iteration 688: log likelihood =  -7773.461  (not concave)
Iteration 689: log likelihood =  -7773.461  (not concave)
Iteration 690: log likelihood =  -7773.461  (not concave)
Iteration 691: log likelihood =  -7773.461  (backed up)
Iteration 692: log likelihood =  -7773.461  (not concave)
Iteration 693: log likelihood =  -7773.461  (not concave)
Iteration 694: log likelihood =  -7773.461  (not concave)
Iteration 695: log likelihood =  -7773.461  (not concave)
Iteration 696: log likelihood =  -7773.461  (not concave)
Iteration 697: log likelihood =  -7773.461  (not concave)
Iteration 698: log likelihood =  -7773.461  (not concave)
Iteration 699: log likelihood =  -7773.461  (not concave)
Iteration 700: log likelihood =  -7773.461  (not concave)
Iteration 701: log likelihood =  -7773.461  (not concave)
Iteration 702: log likelihood =  -7773.461  (not concave)
Iteration 703: log likelihood =  -7773.461  (not concave)
Iteration 704: log likelihood =  -7773.461  (not concave)
Iteration 705: log likelihood =  -7773.461  (not concave)
Iteration 706: log likelihood =  -7773.461  (not concave)
Iteration 707: log likelihood =  -7773.461  (not concave)
Iteration 708: log likelihood =  -7773.461  (backed up)
Iteration 709: log likelihood =  -7773.461  (not concave)
Iteration 710: log likelihood =  -7773.461  (not concave)
Iteration 711: log likelihood =  -7773.461  (not concave)
Iteration 712: log likelihood =  -7773.461  (not concave)
Iteration 713: log likelihood =  -7773.461  (not concave)
Iteration 714: log likelihood =  -7773.461  (not concave)
Iteration 715: log likelihood =  -7773.461  (not concave)
Iteration 716: log likelihood =  -7773.461  (not concave)
Iteration 717: log likelihood =  -7773.461  (not concave)
Iteration 718: log likelihood =  -7773.461  (not concave)
Iteration 719: log likelihood =  -7773.461  (not concave)
Iteration 720: log likelihood =  -7773.461  (not concave)
Iteration 721: log likelihood =  -7773.461  (not concave)
Iteration 722: log likelihood =  -7773.461  (not concave)
Iteration 723: log likelihood = -7773.3861  (not concave)
Iteration 724: log likelihood = -7773.3861  (not concave)
Iteration 725: log likelihood = -7773.3861  (not concave)
Iteration 726: log likelihood = -7773.3861  (not concave)
Iteration 727: log likelihood = -7773.3861  (not concave)
Iteration 728: log likelihood = -7773.3861  (not concave)
Iteration 729: log likelihood = -7773.3861  (not concave)
Iteration 730: log likelihood = -7773.3861  (not concave)
Iteration 731: log likelihood = -7773.3861  (not concave)
Iteration 732: log likelihood = -7773.3861  (not concave)
Iteration 733: log likelihood = -7773.3861  (not concave)
Iteration 734: log likelihood = -7773.3861  (not concave)
Iteration 735: log likelihood = -7773.3861  (not concave)
Iteration 736: log likelihood = -7773.3861  (not concave)
Iteration 737: log likelihood = -7773.3861  (not concave)
Iteration 738: log likelihood = -7773.3861  (not concave)
Iteration 739: log likelihood = -7773.3861  (not concave)
Iteration 740: log likelihood = -7773.3861  (not concave)
Iteration 741: log likelihood = -7773.3861  (not concave)
Iteration 742: log likelihood = -7773.3861  (not concave)
Iteration 743: log likelihood = -7773.3861  (not concave)
Iteration 744: log likelihood = -7773.3861  (not concave)
Iteration 745: log likelihood = -7773.3861  (not concave)
Iteration 746: log likelihood = -7773.3861  (not concave)
Iteration 747: log likelihood = -7773.3861  (not concave)
Iteration 748: log likelihood = -7773.3861  (not concave)
Iteration 749: log likelihood = -7773.3861  (not concave)
Iteration 750: log likelihood = -7773.3861  (not concave)
Iteration 751: log likelihood = -7773.3861  (not concave)
Iteration 752: log likelihood = -7773.3861  (not concave)
Iteration 753: log likelihood = -7773.3861  (not concave)
Iteration 754: log likelihood = -7773.3861  (backed up)
Iteration 755: log likelihood = -7773.3861  (backed up)
Iteration 756: log likelihood = -7773.3861  (not concave)
Iteration 757: log likelihood = -7773.3861  (not concave)
Iteration 758: log likelihood = -7773.3861  (not concave)
Iteration 759: log likelihood = -7773.3861  (not concave)
Iteration 760: log likelihood = -7773.3861  (not concave)
Iteration 761: log likelihood = -7773.3861  (not concave)
Iteration 762: log likelihood = -7773.3861  (not concave)
Iteration 763: log likelihood = -7773.3861  (not concave)
Iteration 764: log likelihood = -7773.3861  (backed up)
Iteration 765: log likelihood = -7773.3861  (not concave)
Iteration 766: log likelihood = -7773.3861  (not concave)
Iteration 767: log likelihood = -7773.3861  (not concave)
Iteration 768: log likelihood = -7773.3861  (not concave)
Iteration 769: log likelihood = -7773.3861  (not concave)
Iteration 770: log likelihood = -7773.3861  (not concave)
Iteration 771: log likelihood = -7773.3861  (not concave)
Iteration 772: log likelihood = -7773.3861  (not concave)
Iteration 773: log likelihood = -7773.3861  (not concave)
Iteration 774: log likelihood = -7773.3861  (not concave)
Iteration 775: log likelihood = -7773.3861  (not concave)
Iteration 776: log likelihood = -7773.3861  (not concave)
Iteration 777: log likelihood = -7773.3861  (not concave)
Iteration 778: log likelihood = -7773.3861  (not concave)
Iteration 779: log likelihood = -7773.3861  (not concave)
Iteration 780: log likelihood = -7773.3861  (not concave)
Iteration 781: log likelihood = -7773.3861  (not concave)
Iteration 782: log likelihood = -7773.3861  (not concave)
Iteration 783: log likelihood = -7773.3664  (not concave)
Iteration 784: log likelihood = -7773.3664  (not concave)
Iteration 785: log likelihood = -7773.3664  (not concave)
Iteration 786: log likelihood = -7773.3664  (not concave)
Iteration 787: log likelihood = -7773.3664  (not concave)
Iteration 788: log likelihood = -7773.3664  (not concave)
Iteration 789: log likelihood = -7773.3664  (not concave)
Iteration 790: log likelihood = -7773.3664  (not concave)
Iteration 791: log likelihood = -7773.3664  (not concave)
Iteration 792: log likelihood = -7773.3664  (not concave)
Iteration 793: log likelihood = -7773.3664  (not concave)
Iteration 794: log likelihood = -7773.3664  (not concave)
Iteration 795: log likelihood = -7773.3664  (not concave)
Iteration 796: log likelihood = -7773.3664  (not concave)
Iteration 797: log likelihood = -7773.3664  (not concave)
Iteration 798: log likelihood = -7773.3664  (not concave)
Iteration 799: log likelihood = -7773.3664  (not concave)
Iteration 800: log likelihood = -7773.3664  (not concave)
Iteration 801: log likelihood = -7773.3664  (not concave)
Iteration 802: log likelihood = -7773.3664  (not concave)
Iteration 803: log likelihood = -7773.3664  (not concave)
Iteration 804: log likelihood = -7773.3664  (not concave)
Iteration 805: log likelihood = -7773.3664  (not concave)
Iteration 806: log likelihood = -7773.3664  (not concave)
Iteration 807: log likelihood = -7773.3664  (not concave)
Iteration 808: log likelihood = -7773.3664  (not concave)
Iteration 809: log likelihood = -7773.3664  (not concave)
Iteration 810: log likelihood = -7773.3664  (not concave)
Iteration 811: log likelihood = -7773.3664  (not concave)
Iteration 812: log likelihood = -7773.3664  (not concave)
Iteration 813: log likelihood = -7773.3664  (not concave)
Iteration 814: log likelihood = -7773.3664  (not concave)
Iteration 815: log likelihood = -7773.3664  (not concave)
Iteration 816: log likelihood = -7773.3664  (not concave)
Iteration 817: log likelihood = -7773.3639  (not concave)
Iteration 818: log likelihood = -7773.3639  (not concave)
Iteration 819: log likelihood = -7773.3639  (not concave)
Iteration 820: log likelihood = -7773.3639  (not concave)
Iteration 821: log likelihood = -7773.3639  (not concave)
Iteration 822: log likelihood = -7773.3639  (not concave)
Iteration 823: log likelihood = -7773.3639  (not concave)
Iteration 824: log likelihood = -7773.3639  (not concave)
Iteration 825: log likelihood = -7773.3639  (not concave)
Iteration 826: log likelihood = -7773.3639  (not concave)
Iteration 827: log likelihood = -7773.3639  (not concave)
Iteration 828: log likelihood = -7773.3639  (not concave)
Iteration 829: log likelihood = -7773.3639  (not concave)
Iteration 830: log likelihood = -7773.3639  (not concave)
Iteration 831: log likelihood = -7773.3639  (not concave)
Iteration 832: log likelihood = -7773.3639  (not concave)
Iteration 833: log likelihood = -7773.3639  (not concave)
Iteration 834: log likelihood = -7773.3639  (not concave)
Iteration 835: log likelihood = -7773.3639  (not concave)
Iteration 836: log likelihood = -7773.3639  (backed up)
Iteration 837: log likelihood = -7773.3639  (not concave)
Iteration 838: log likelihood = -7773.3639  (not concave)
Iteration 839: log likelihood = -7773.3639  (not concave)
Iteration 840: log likelihood = -7773.3639  (not concave)
Iteration 841: log likelihood = -7773.3639  (backed up)
Iteration 842: log likelihood = -7773.3639  (backed up)
Iteration 843: log likelihood = -7773.3081  (not concave)
Iteration 844: log likelihood = -7773.3081  (not concave)
Iteration 845: log likelihood = -7773.3081  (not concave)
Iteration 846: log likelihood = -7773.3081  (not concave)
Iteration 847: log likelihood = -7773.3081  (not concave)
Iteration 848: log likelihood = -7773.3081  (not concave)
Iteration 849: log likelihood = -7773.3081  (not concave)
Iteration 850: log likelihood = -7773.3081  (not concave)
Iteration 851: log likelihood = -7773.3081  (not concave)
Iteration 852: log likelihood = -7773.3081  (not concave)
Iteration 853: log likelihood = -7773.3081  (not concave)
Iteration 854: log likelihood = -7773.3081  (not concave)
Iteration 855: log likelihood = -7773.3081  (not concave)
Iteration 856: log likelihood = -7773.3081  (not concave)
Iteration 857: log likelihood = -7773.3081  (not concave)
Iteration 858: log likelihood = -7773.3081  (not concave)
Iteration 859: log likelihood = -7773.3081  (not concave)
Iteration 860: log likelihood = -7773.3081  (not concave)
Iteration 861: log likelihood = -7773.3081  (backed up)

Mixed-effects logistic regression               Number of obs     =     24,551
Group variable:          vendor                 Number of groups  =      1,040

                                                Obs per group:
                                                              min =          1
                                                              avg =       23.6
                                                              max =         51

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(12)     =     306.34
Log likelihood = -7773.3081                     Prob > chi2       =     0.0000
------------------------------------------------------------------------------------------
          has_price_drop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
        ln_neg_count_min |  -.0262257   .0177226    -1.48   0.139    -.0609613    .0085099
                     arf |  -.3392037   .3234166    -1.05   0.294    -.9730886    .2946812
                         |
c.ln_neg_count_min#c.arf |    .039822   .0844046     0.47   0.637    -.1256079    .2052519
                         |
        ln_pos_count_min |  -.0977452   .0264878    -3.69   0.000    -.1496604     -.04583
                    ln_w |   .0083661   .0361573     0.23   0.817    -.0625009     .079233
                         |
                       q |
                      2  |  -.5001181   .0875311    -5.71   0.000    -.6716759   -.3285604
                      3  |  -1.169791   .1684366    -6.94   0.000     -1.49992   -.8396612
                      4  |   -2.20026    .302615    -7.27   0.000    -2.793375   -1.607146
                         |
                   items |
                      1  |  -.2030542   .0625815    -3.24   0.001    -.3257117   -.0803967
                      2  |    -.39224   .0824853    -4.76   0.000    -.5539082   -.2305718
                         |
              categories |
                      1  |  -.1131154   .0585294    -1.93   0.053    -.2278308    .0016001
                      2  |  -.1344272   .0746955    -1.80   0.072    -.2808278    .0119733
                         |
                   _cons |  -1.234629   .0938384   -13.16   0.000    -1.418549   -1.050709
-------------------------+----------------------------------------------------------------
vendor                   |
                 var(arf)|   1.843358   .0003072                      1.842756     1.84396
               var(_cons)|   .0435306   7.57e-06                      .0435158    .0435455
-------------------------+----------------------------------------------------------------
vendor                   |
           cov(_cons,arf)|  -.2832711   .0000192 -1.5e+04   0.000    -.2833087   -.2832336
------------------------------------------------------------------------------------------
LR test vs. logistic model: chi2(3) = 1.58                Prob > chi2 = 0.6645

Note: LR test is conservative and provided only for reference.

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:  18 Mar 2020, 18:32:49
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
