
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  25 Mar 2020, 16:59:02

. 
. // normalize features
. gen ln_neg_count_min = ln(neg_count_min)

. replace ln_neg_count_min = 0 if ln_neg_count_min == .
(0 real changes made)

. gen ln_pos_count_min = ln(pos_count_min)

. gen ln_w = ln(w)

. 
. // group items in terciles
. gen items = .
(23,511 missing values generated)

. replace items = 0 if item_count_w <=13
(17,926 real changes made)

. replace items = 1 if item_count_w > 13 & item_count_w <= 32
(4,139 real changes made)

. replace items = 2 if item_count_w > 32
(1,446 real changes made)

. 
. // group size in terciles
. gen size = .
(23,511 missing values generated)

. replace size = 0 if cum_count <= 849
(7,628 real changes made)

. replace size = 1 if cum_count > 849 & count <= 3170
(12,326 real changes made)

. replace size = 2 if cum_count > 3170
(7,945 real changes made)

. 
. recode m_maxw (1/3 = 1) (4/6 = 2) (6/9 = 3) (10/12 = 4), gen(q)
(12556 differences between m_maxw and q)

. 
. mepoisson ln_neg_count_min c.arf i.q international_shipment i.items i.size category_count || w: 
note: ln_neg_count_min has noncount values;
      you are responsible for the family(poisson) interpretation
Fitting fixed-effects model:

Iteration 0:   log likelihood = -44648.156  
Iteration 1:   log likelihood = -42165.877  
Iteration 2:   log likelihood = -42097.571  
Iteration 3:   log likelihood = -42084.478  
Iteration 4:   log likelihood = -42081.524  
Iteration 5:   log likelihood = -42080.853  
Iteration 6:   log likelihood = -42080.692  
Iteration 7:   log likelihood =  -42080.66  
Iteration 8:   log likelihood = -42080.654  
Iteration 9:   log likelihood = -42080.653  
Iteration 10:  log likelihood = -42080.653  
Iteration 11:  log likelihood = -42080.653  

Refining starting values:

Grid node 0:   log likelihood = -39638.981

Refining starting values (unscaled likelihoods):

Grid node 0:   log likelihood = -40329.672

Fitting full model:

numerical derivatives are approximate
nearby values are missing
Iteration 0:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 1:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 2:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 3:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 4:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 5:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 6:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 7:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 8:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 9:   log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 10:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 11:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 12:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 13:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 14:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 15:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 16:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 17:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 18:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 19:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 20:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 21:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 22:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 23:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 24:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 25:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 26:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 27:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 28:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 29:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 30:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 31:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 32:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 33:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 34:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 35:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 36:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 37:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 38:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 39:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 40:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 41:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 42:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 43:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 44:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 45:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 46:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 47:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 48:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 49:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 50:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 51:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 52:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 53:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 54:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 55:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 56:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 57:  log likelihood = -40329.672  (not concave)
numerical derivatives are approximate
nearby values are missing
Iteration 58:  log likelihood = -40329.672  (not concave)
