
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406287832
         Licensed to:  Social Sciences
                       Utrecht University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do /Users/MacbookJos/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/MacbookJos/.ipython/stata/data_input.dta", clear 

. log using "/Users/MacbookJos/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 opened on:  25 Mar 2020, 17:26:55

. 
. // normalize features
. gen ln_neg_count_min = ln(neg_count_min)

. replace ln_neg_count_min = 0 if ln_neg_count_min == .
(0 real changes made)

. gen ln_pos_count_min = ln(pos_count_min)

. gen ln_w = ln(w)

. 
. // group items in terciles
. gen items = .
(23,511 missing values generated)

. replace items = 0 if item_count_w <=13
(17,926 real changes made)

. replace items = 1 if item_count_w > 13 & item_count_w <= 32
(4,139 real changes made)

. replace items = 2 if item_count_w > 32
(1,446 real changes made)

. 
. // group size in terciles
. gen size = .
(23,511 missing values generated)

. replace size = 0 if cum_count <= 849
(7,628 real changes made)

. replace size = 1 if cum_count > 849 & count <= 3170
(12,326 real changes made)

. replace size = 2 if cum_count > 3170
(7,945 real changes made)

. 
. recode m_maxw (1/3 = 1) (4/6 = 2) (6/9 = 3) (10/12 = 4), gen(q)
(12556 differences between m_maxw and q)

. 
. mixed ln_neg_count_min c.arf i.q international_shipment i.items i.size category_count ///
>    || w: ,  nolrtest

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log likelihood = -42098.926  
Iteration 1:   log likelihood = -42098.926  

Computing standard errors:

Mixed-effects ML regression                     Number of obs     =     23,511
Group variable: w                               Number of groups  =         50

                                                Obs per group:
                                                              min =          1
                                                              avg =      470.2
                                                              max =        861

                                                Wald chi2(10)     =   10589.69
Log likelihood = -42098.926                     Prob > chi2       =     0.0000

----------------------------------------------------------------------------------------
      ln_neg_count_min |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                   arf |   .1326293   .0510276     2.60   0.009     .0326171    .2326415
                       |
                     q |
                    2  |  -.3574871   .0336044   -10.64   0.000    -.4233506   -.2916236
                    3  |   -.830163   .0506627   -16.39   0.000      -.92946   -.7308661
                    4  |  -.7652063   .0671763   -11.39   0.000    -.8968694   -.6335432
                       |
international_shipment |   .4427094   .0205524    21.54   0.000     .4024275    .4829913
                       |
                 items |
                    1  |   .4990119   .0285791    17.46   0.000     .4429979    .5550259
                    2  |    1.17739   .0441271    26.68   0.000     1.090903    1.263878
                       |
                  size |
                    1  |   .5808278   .0241563    24.04   0.000     .5334823    .6281733
                    2  |   1.485316   .0286593    51.83   0.000     1.429145    1.541487
                       |
        category_count |   .0534864   .0055324     9.67   0.000     .0426431    .0643298
                 _cons |   1.278988   .0926662    13.80   0.000     1.097365     1.46061
----------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
w: Identity                  |
                  var(_cons) |   .3888899   .0799149      .2599616    .5817605
-----------------------------+------------------------------------------------
               var(Residual) |   2.083779   .0192393      2.046409     2.12183
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/MacbookJos/.ipython/stata/log_output.log
  log type:  text
 closed on:  25 Mar 2020, 17:26:59
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
